IDENTIFICATION DIVISION.
PROGRAM-ID. tabel-1-dimensi.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 TABEL-KELAS.
 05 NAMA OCCURS 3 TIMES.
  10 ANGGOTA PIC A(20).

77 NOMOR PIC 9.

PROCEDURE DIVISION.


PROGRAM-BEGIN.
	PERFORM AMBILDATA
		VARYING NOMOR FROM 1 BY 1 UNTIL NOMOR > 3.
	
	PERFORM HEADER.
	PERFORM TAMPILKAN-DATA
		VARYING NOMOR FROM 1 BY 1 UNTIL NOMOR > 3.
	STOP RUN.
AMBILDATA.
		DISPLAY "NAMA ANGGOTA KELAS KE-", NOMOR, ": ".
		ACCEPT ANGGOTA(NOMOR).
		
HEADER.
		DISPLAY "DAFTAR NAMA ANGGOTA KELAS".
		DISPLAY "NO", "     ", "NAMA".
		DISPLAY "===================".
TAMPILKAN-DATA.
		
		DISPLAY "| ", NOMOR, " | ", ANGGOTA(NOMOR).	

	
	