IDENTIFICATION DIVISION.
PROGRAM-ID. tabel-3-dimensi.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 TABEL-JURUSAN.
05 FAKULTAS OCCURS 3 TIMES.
10 KELAS OCCURS 2 TIMES.
15 NAMA OCCURS 3 TIMES.
20 ANGGOTA PIC A(20).

77 NOMOR-FAKULTAS PIC 9.
77 NOMOR-KELAS PIC 9.
77 NOMOR-NAMA PIC 9.

PROCEDURE DIVISION.

PROGRAM-BEGIN.
	PERFORM AMBILFAKULTAS
		VARYING NOMOR-FAKULTAS FROM 1 BY 1 UNTIL NOMOR-FAKULTAS > 3.

	PERFORM HEADER.
	PERFORM TAMPILKAN-DATA
		VARYING NOMOR-NAMA FROM 1 BY 1 UNTIL NOMOR-NAMA > 3.
	STOP RUN.
	
AMBILFAKULTAS.
	DISPLAY "SELAMAT DATANG DI FAKULTAS YANG KE-" , NOMOR-FAKULTAS.
	PERFORM AMBILKELAS
	VARYING NOMOR-KELAS FROM 1 BY 1 UNTIL NOMOR-KELAS > 2.
	
AMBILKELAS.
	DISPLAY "SILAHKAN MASUKKAN NAMA-NAMA ANGGOTA UNTUK KELAS YANG KE-" , NOMOR-KELAS.
	PERFORM AMBILNAMA
	VARYING NOMOR-NAMA FROM 1 BY 1 UNTIL NOMOR-NAMA > 3.
	
AMBILNAMA.
	DISPLAY "NAMA ANGGOTA YANG KE-", NOMOR-NAMA, ": ".
	ACCEPT ANGGOTA(NOMOR-FAKULTAS,NOMOR-KELAS, NOMOR-NAMA).
	
HEADER.
	DISPLAY " ". DISPLAY " ". DISPLAY " ".
	DISPLAY "           FAKULTAS #1                       |           FAKULTAS #2                       |           FAKULTAS #3                      |".
	DISPLAY " KELAS PERTAMA        | KELAS KEDUA          | KELAS PERTAMA        | KELAS KEDUA          | KELAS PERTAMA       | KELAS KEDUA          |".
	DISPLAY "======================|======================|======================|======================|=====================|======================|".
	DISPLAY "    NAMA              |    NAMA              |    NAMA              |    NAMA              |    NAMA             |    NAMA              |".
	DISPLAY "======================|======================|======================|======================|=====================|======================|".
	
TAMPILKAN-DATA.
DISPLAY "| ", ANGGOTA(1, 1, NOMOR-NAMA), "| ", ANGGOTA(1, 2, NOMOR-NAMA),"| ", ANGGOTA(2, 1, NOMOR-NAMA),"| ", ANGGOTA(2, 2, NOMOR-NAMA),"| ", ANGGOTA(3, 1, NOMOR-NAMA),"| ", ANGGOTA(3, 2, NOMOR-NAMA).
	
