IDENTIFICATION DIVISION.
PROGRAM-ID. tabel-2-dimensi.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 TABEL-FAKULTAS.
 05 KELAS OCCURS 2 TIMES.
  10 NAMA OCCURS 3 TIMES.
   13 ANGGOTA PIC A(20).


77 NOMOR-KELAS PIC 9.
77 NOMOR-NAMA PIC 9.

PROCEDURE DIVISION.

PROGRAM-BEGIN.
	PERFORM AMBILKELAS
		VARYING NOMOR-KELAS FROM 1 BY 1 UNTIL NOMOR-KELAS > 2.
	
	PERFORM HEADER.
	PERFORM TAMPILKAN-DATA
		VARYING NOMOR-NAMA FROM 1 BY 1 UNTIL NOMOR-NAMA > 3.
	STOP RUN.

AMBILKELAS.
	DISPLAY " ".
	DISPLAY "SILAHKAN MASUKKAN NAMA-NAMA ANGGOTA UNTUK KELAS YANG KE-" , NOMOR-KELAS.
	PERFORM AMBILNAMA
		VARYING NOMOR-NAMA FROM 1 BY 1 UNTIL NOMOR-NAMA > 3.

AMBILNAMA.
	DISPLAY " ".
	DISPLAY "NAMA ANGGOTA YANG KE-", NOMOR-NAMA, ": ".
	ACCEPT ANGGOTA(NOMOR-KELAS, NOMOR-NAMA).
	
HEADER.
	DISPLAY " ".
	DISPLAY " ".
	DISPLAY "===============================================".
	DISPLAY "    KELAS PERTAMA              KELAS KEDUA     ".
	DISPLAY "==============================================="
	DISPLAY "       NAMA          "," | ","         NAMA    ".
	DISPLAY "====================="," | ","=======================".

TAMPILKAN-DATA.
DISPLAY "| ", ANGGOTA(1, NOMOR-NAMA), "| ", ANGGOTA(2, NOMOR-NAMA).
		
		
		
